# Eat Safe, Love

## Notebook Set Up

In [24]:
# Import dependencies
from pymongo import MongoClient
from pprint import pprint
import pandas as pd
import matplotlib.pyplot as plt

In [25]:
# Create an instance of MongoClient
mongo = MongoClient(port=27017)

In [26]:
# confirm that our new database was created
print(mongo.list_database_names())

['admin', 'classDB', 'config', 'epa', 'local', 'met', 'petsitly_marketing', 'uk_food']

In [27]:
# assign the uk_food database to a variable name
db = mongo['uk_food']

In [28]:
# review the collections in our database
pprint(db.list_collection_names())

['establishments']

In [29]:
# assign the collection to a variable
establishments = db['establishments']

In [30]:
establishments.count_documents({})

39783

## Part 3: Exploratory Analysis
Unless otherwise stated, for each question: 
* Use `count_documents` to display the number of documents contained in the result.
* Display the first document in the results using `pprint`.
* Convert the result to a Pandas DataFrame, print the number of rows in the DataFrame, and display the first 10 rows.

### 1. Which establishments have a hygiene score equal to 20?

In [73]:
db.establishments.find( {'scores.Hygiene': 20} )

In [75]:

# Use count_documents to display the number of documents in the result
db.establishments.count_documents( {'scores.Hygiene': 20} )

41

In [76]:
# Find the establishments with a hygiene score of 20

# Write a match query to find only hygiene score of 20
#match_query = {'$match': {'scores.elementscores.Hygiene': {'$gte': 5}}}
match_query = {'$match': {'scores.Hygiene': {'$eq': 20}}}

# Write an aggregation query that counts the number of documents, grouped by "country"
group_query = {'$group': {'_id': "$BusinessName", 'count': { '$sum': 1 }}}

# Create a dictionary that will allow the pipeline to sort by count in descending order
sort_values = {'$sort': { 'count': -1 }}

# Put the pipeline together
pipeline = [match_query, group_query, sort_values]

In [77]:
# Run the pipeline through the aggregate method and save the results to a variable
results = list(establishments.aggregate(pipeline))

In [78]:
# Print the number of countries in the result
print("Number of restaurants hygiene rating =20 in result: ", len(results))

Number of restaurants hygiene rating =20 in result:  40

In [82]:


# Display the first document in the results using pprint

In [80]:
# Convert the result to a Pandas DataFrame

result_df = pd.DataFrame(results)

# Display the number of rows in the DataFrame
print("Rows in DataFrame: ", len(result_df))


# Display the first 10 rows of the DataFrame
result_df.head(10)

Rows in DataFrame:  40

                                             _id  count
0                                  Golden Palace      2
1                  Great Hallingbury Manor Hotel      1
2                                 The Tulip Tree      1
3                                        Xich Lo      1
4                                  Melrose Hotel      1
5  Asian Supermarket Ltd: T/A Best Food Wine Ltd      1
6                                      Gospodina      1
7                               The Dog And Duck      1
8                                   La Simon Ltd      1
9                    Sahajanand Catering Limited      1

### 2. Which establishments in London have a `RatingValue` greater than or equal to 4?

In [93]:
#update datatype for RatingValue

#establishments.update_many({}, [ {'$set': { "RatingValue" : {'$toInt': "$RatingValue"}}}])

In [104]:
# Find the establishments with London as the Local Authority and has a RatingValue greater than or equal to 4.







#query =

match_query = {'$match': {'LocalAuthorityName': {'$regex': 'London'},'RatingValue': {'$gte': '4'}}}
#match_query = {'$match': {'LocalAuthorityName': {'$regex': 'London'}}}
#match_query = {'$match': {'RatingValue': {'$gte': '5'}}}



# Write an aggregation query that counts the number of documents, grouped by "country"
group_query = {'$group': {'_id': "$BusinessName", 'count': { '$sum': 1 }}}

# Create a dictionary that will allow the pipeline to sort by count in descending order
sort_values = {'$sort': { 'count': -1 }}

# Put the pipeline together
pipeline = [match_query, group_query, sort_values]


# Run the pipeline through the aggregate method and save the results to a variable
results = list(establishments.aggregate(pipeline))

# Print the number of countries in the result
print("Local Authority London ratings >=4: ", len(results))

# Use count_documents to display the number of documents in the result

# Display the first document in the results using pprint

Local Authority London ratings >=4:  34

In [100]:
# Convert the result to a Pandas DataFrame

result_df = pd.DataFrame(results)

# Display the number of rows in the DataFrame
print("Rows in DataFrame: ", len(result_df))


# Display the first 10 rows of the DataFrame
result_df.head(10)

Rows in DataFrame:  34

                             _id  count
0  The Nuance Group (UK) Limited      1
1               City Bar & Grill      1
2         Mv Sunborn Yacht Hotel      1
3                  La Nonna lina      1
4      Wake Up Docklands Limited      1
5                MV Moon clipper      1
6              MV Galaxy clipper      1
7        Mv City Cruises Erasmus      1
8              MV Aurora clipper      1
9             MV Monsoon clipper      1

### 3. What are the top 5 establishments with a `RatingValue` rating value of '5', sorted by lowest hygiene score, nearest to the new restaurant added, "Penang Flavours"?

In [ ]:
# Search within 0.01 degree on either side of the latitude and longitude.
# Rating value must equal 5
# Sort by hygiene score

degree_search = 0.01
latitude = 
longitude = 

query = 
sort =  

# Print the results

In [ ]:
# Convert result to Pandas DataFrame

### 4. How many establishments in each Local Authority area have a hygiene score of 0?

In [ ]:
# Create a pipeline that: 
# 1. Matches establishments with a hygiene score of 0
# 2. Groups the matches by Local Authority
# 3. Sorts the matches from highest to lowest

# Print the number of documents in the result

# Print the first 10 results

In [ ]:
# Convert the result to a Pandas DataFrame

# Display the number of rows in the DataFrame

# Display the first 10 rows of the DataFrame